# CannotCreateCurtainGrid Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotCreateCurtainGrid Property
BuiltInFailures..::..CreationFailures Class See Also
---
Can't create Curtain Wall Grid Line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateCurtainGrid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateCurtainGrid As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateCurtainGrid {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace